# Pandas

In [1]:
import pandas as pd # conda install pandas

In [2]:
list("abcde") #EG not to code

['a', 'b', 'c', 'd', 'e']

In [3]:
[list("abcde"),#EG not to code
 [1,2,3,4,5],
list("qwert"),
[6,7,8,9,10]]

[['a', 'b', 'c', 'd', 'e'],
 [1, 2, 3, 4, 5],
 ['q', 'w', 'e', 'r', 't'],
 [6, 7, 8, 9, 10]]

In [4]:
import pandas as pd
data=pd.DataFrame([list("abcde"),
                   [1,2,3,4,5],
                   list("qwert"),
                   [6,7,8,9,10]],
                  index=list("asdf"),
                  columns=list("mnxyz"))
data

   m  n  x  y   z
a  a  b  c  d   e
s  1  2  3  4   5
d  q  w  e  r   t
f  6  7  8  9  10

#

In [ ]:
list("abc")

In [5]:
d={"k":[12,23,34],"k2":[17,34,55]}   # passing list
pd.DataFrame(d,index=list("abc")) #["a","b","c"]

    k  k2
a  12  17
b  23  34
c  34  55

In [6]:
d={"k":[12,23,34],"k2":[17,34,55]}   # passing list
pd.DataFrame(d)

    k  k2
0  12  17
1  23  34
2  34  55

In [7]:
d={"k":12,"k2":17}  # passing single value so need to pass index required
pd.DataFrame(d)

ValueError: If using all scalar values, you must pass an index

In [8]:
d={"k":12,"k2":17}  # passing single value so need to pass index required
pd.DataFrame(d,index=[1])

    k  k2
1  12  17

In [9]:
d={"k":[12],"k2":[17]} # single value list passing no index required
pd.DataFrame(d)

    k  k2
0  12  17

In [10]:
d={"k":[12,13,14],"k2":[17]} # single value and multi value list passing
pd.DataFrame(d)              #error   arrays must all be same length

ValueError: All arrays must be of the same length

In [11]:
d={"k":[12,13,14],"k2":17} # single value and multi value list passing
pd.DataFrame(d)

    k  k2
0  12  17
1  13  17
2  14  17

In [12]:
a=['abc','xyz','pqr']
b=['q','w','r']
d={"k":a,"k2":b} # with string variables Data Frame
pd.DataFrame(d)

     k k2
0  abc  q
1  xyz  w
2  pqr  r

In [13]:
a=['abc','xyz','pqr']
b="qwert"
d={"k":a,"k2":b} # with list and a variables Data Frame
pd.DataFrame(d)

     k     k2
0  abc  qwert
1  xyz  qwert
2  pqr  qwert

#### Creating new DF variable

In [24]:
pd.__version__

'2.2.2'

In [14]:
import pandas as pd
a=['abc','xyz','pqr']
b="qwert"
d={"k":a,"k2":b} # with list and a variables Data Frame
df=pd.DataFrame(d) # assigning the Data Frame to a variable 
df   # new

     k     k2
0  abc  qwert
1  xyz  qwert
2  pqr  qwert

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   k       3 non-null      object
 1   k2      3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [16]:
df.describe()

          k     k2
count     3      3
unique    3      1
top     abc  qwert
freq      1      3

In [17]:
df.columns

Index(['k', 'k2'], dtype='object')

In [18]:
df.columns=["key1","key2"] #changing the column name
df

  key1   key2
0  abc  qwert
1  xyz  qwert
2  pqr  qwert

In [19]:
df.rename(columns = {"key2": "Names"},  
          inplace = True)

In [20]:
df

  key1  Names
0  abc  qwert
1  xyz  qwert
2  pqr  qwert

In [21]:
list(df.index)

[0, 1, 2]

In [22]:
df.columns=["key1","key2","key3"] #3rd column does not exist
df

ValueError: Length mismatch: Expected axis has 2 elements, new values have 3 elements

In [25]:
df

  key1  Names
0  abc  qwert
1  xyz  qwert
2  pqr  qwert

In [26]:
df["key1"]  #PRINTING THE SINGLE COLUMN AS SERIES

0    abc
1    xyz
2    pqr
Name: key1, dtype: object

In [27]:
df[["key1"]] #as a DATA FRAME

  key1
0  abc
1  xyz
2  pqr

In [28]:
c={"k":[2,3,4,5,6],
   "k2":[22,23,24,25,26],
   "k3":[32,33,34,35,36],
   "k4":[42,43,44,45,46]}

df1=pd.DataFrame(c)

In [29]:
df1

   k  k2  k3  k4
0  2  22  32  42
1  3  23  33  43
2  4  24  34  44
3  5  25  35  45
4  6  26  36  46

In [30]:
df1[0:2]  # df1[row start:row end,col start:col end]

   k  k2  k3  k4
0  2  22  32  42
1  3  23  33  43

In [31]:
df1[2:] # till end

   k  k2  k3  k4
2  4  24  34  44
3  5  25  35  45
4  6  26  36  46

In [32]:
df1[:2]  # from start

   k  k2  k3  k4
0  2  22  32  42
1  3  23  33  43

In [33]:
df1[["k2"]]

   k2
0  22
1  23
2  24
3  25
4  26

In [34]:
df1[["k2","k3"]]

   k2  k3
0  22  32
1  23  33
2  24  34
3  25  35
4  26  36

In [35]:
df1[["k2","k3"]][:2]

   k2  k3
0  22  32
1  23  33

#### Loc and iLoc

In [47]:
df1

   k  k2  k3  k4
a  2  22  32  42
b  3  23  33  43
c  4  24  34  44
d  5  25  35  45
e  6  26  36  46

In [48]:
df1.T

     a   b   c   d   e
k    2   3   4   5   6
k2  22  23  24  25  26
k3  32  33  34  35  36
k4  42  43  44  45  46

In [37]:
df1.iloc[2]

k      4
k2    24
k3    34
k4    44
Name: 2, dtype: int64

In [38]:
df1.iloc[[2]]  #when index is numerical

   k  k2  k3  k4
2  4  24  34  44

In [39]:
df1.loc[[2]]  #when index is numerical both work

   k  k2  k3  k4
2  4  24  34  44

In [ ]:
list("abcde")

In [43]:
df1.index=list("abcde") #making index as str # ['a','b'....'e']
df1

   k  k2  k3  k4
a  2  22  32  42
b  3  23  33  43
c  4  24  34  44
d  5  25  35  45
e  6  26  36  46

In [41]:
df1.iloc[[2]]  #iloc by index number

   k  k2  k3  k4
c  4  24  34  44

In [42]:
df1.loc[['c']] # loc with str index

   k  k2  k3  k4
c  4  24  34  44

####  loc take index name and iloc take index number

In [44]:
df1

   k  k2  k3  k4
a  2  22  32  42
b  3  23  33  43
c  4  24  34  44
d  5  25  35  45
e  6  26  36  46

In [45]:
df1.loc[['c'],['k2']]

   k2
c  24

In [46]:
df1.loc[['c'],['k2','k3']]

   k2  k3
c  24  34

In [50]:
df1.loc[['c','d']]

   k  k2  k3  k4
c  4  24  34  44
d  5  25  35  45

In [51]:
df1.loc[['c','d'],['k2','k3']]

   k2  k3
c  24  34
d  25  35

In [52]:
df1.loc[:,['k2']]

   k2
a  22
b  23
c  24
d  25
e  26

In [53]:
df1

   k  k2  k3  k4
a  2  22  32  42
b  3  23  33  43
c  4  24  34  44
d  5  25  35  45
e  6  26  36  46

In [54]:
df1.iloc[[0],:]

   k  k2  k3  k4
a  2  22  32  42

In [55]:
df1.iloc[[1,2],[0,1]]

   k  k2
b  3  23
c  4  24

In [56]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   k       5 non-null      int64
 1   k2      5 non-null      int64
 2   k3      5 non-null      int64
 3   k4      5 non-null      int64
dtypes: int64(4)
memory usage: 372.0+ bytes

In [ ]:
df1

In [57]:
df1.describe()

              k         k2         k3         k4
count  5.000000   5.000000   5.000000   5.000000
mean   4.000000  24.000000  34.000000  44.000000
std    1.581139   1.581139   1.581139   1.581139
min    2.000000  22.000000  32.000000  42.000000
25%    3.000000  23.000000  33.000000  43.000000
50%    4.000000  24.000000  34.000000  44.000000
75%    5.000000  25.000000  35.000000  45.000000
max    6.000000  26.000000  36.000000  46.000000

In [59]:
df1.columns

Index(['k', 'k2', 'k3', 'k4'], dtype='object')

In [60]:
df1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [61]:
df1["k2"].mean()

24.0

In [ ]:
df1.mean()

Pandas.apply allow the users to pass a function and apply it on every single value of the Pandas series. It comes as a huge improvement for the pandas library as this function helps to segregate data according to the conditions required due to which it is efficiently used in data science and machine learning.

Assiengment : Create a Data Frame by taking input from user of 10 employee having there name and salary then print it as a result?

In [ ]:
df1

#### apply

In [62]:
def x(a):
    return a**2

In [63]:
x(3)

9

In [64]:
x=lambda a:a**2

In [65]:
x(3)

9

In [67]:
df1.k

a    2
b    3
c    4
d    5
e    6
Name: k, dtype: int64

In [68]:
df1.k.apply(x)

a     4
b     9
c    16
d    25
e    36
Name: k, dtype: int64

In [70]:
x=lambda x:x**2
df1[["k","k2"]].apply(x)

    k   k2
a   4  484
b   9  529
c  16  576
d  25  625
e  36  676

In [ ]:
df1.k

In [ ]:
df1

In [ ]:
def x(a):
    return a**2

In [69]:
df1.k.apply(lambda x:x**2)

a     4
b     9
c    16
d    25
e    36
Name: k, dtype: int64

In [72]:
df1.k=df1.k.apply(x)  # to make it parmenent
df1

    k  k2  k3  k4
a   4  22  32  42
b   9  23  33  43
c  16  24  34  44
d  25  25  35  45
e  36  26  36  46

# Plot

In [73]:
import pandas as pd
import numpy as np
#from numpy.random import random as rm

In [77]:
np.random.randint(1,100,10) # (start,end,number_of_values)

array([38, 85, 69, 99, 32, 12, 93, 15,  4, 79])

In [78]:
np.random.randint(0,10,5)

array([3, 0, 0, 9, 9])

In [79]:
import calendar
yr=list(calendar.month_abbr)[1:]
yr

['Jan',
 'Feb',
 'Mar',
 'Apr',
 'May',
 'Jun',
 'Jul',
 'Aug',
 'Sep',
 'Oct',
 'Nov',
 'Dec']

In [ ]:
#import pandas as pd
#import numpy as np
#data={"Sales_1":np.random.randint(1,100,12),
#      "Sales_2":np.random.randint(1,100,12),
#      "Sales_3":np.random.randint(1,100,12),
#      "Sales_4":np.random.randint(1,100,12)}
#data=pd.DataFrame(data,index=yr)
#data

#### Problem Statement
- Its a sales data of 4 team and company want to compare there performance

In [80]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
 

data={"Sales_1":np.random.randint(1,100,12),
      "Sales_2":np.random.randint(1,100,12),
      "Sales_3":np.random.randint(1,100,12),
      "Sales_4":np.random.randint(1,100,12)}
ind=["Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct","Nov","Dec"]
data=pd.DataFrame(data,index=ind)
data

     Sales_1  Sales_2  Sales_3  Sales_4
Jan        6       83       14       28
Feb       24       64       80       10
Mar       58       15       80       53
Apr       68        5       12       60
May       29       67       21       95
Jun       12       65       57       67
Jul       91       83       72        4
Aug        3        9       67       72
Sep       11       39       57       21
Oct       63       76       76       84
Nov       95       21       96       35
Dec       81       31       19       72

# Plot Type
    - 'line' : line plot (default)
    - 'bar' : vertical bar plot
    - 'barh' : horizontal bar plot
    - 'hist' : histogram
    - 'box' : boxplot
    - 'kde' : Kernel Density Estimation plot
    - 'density' : same as 'kde'
    - 'area' : area plot
    - 'pie' : pie plot
    - 'scatter' : scatter plot
    - 'hexbin' : hexbin plot.

In [ ]:
data.Sales_1.plot() # by default kind= line

In [ ]:
data[["Sales_1","Sales_2"]].plot(legend=True)

In [ ]:
data.Sales_1.plot(kind="bar",legend=True)

In [ ]:
data[["Sales_1","Sales_2"]].plot(kind="bar",legend=True)

In [ ]:
data[["Sales_1","Sales_2"]].plot(kind="bar",legend=True,subplots=True)
    #data.Sales_2.plot(kind=,legend=True,subplots=True)

In [ ]:
data.Sales_1.plot(kind="pie")

In [ ]:
data[["Sales_1","Sales_2"]].plot(kind="pie",subplots=True,legend=False)

In [ ]:
data.Sales_3.plot(kind="barh",legend=True)

In [ ]:
data.plot(kind="area",legend=True)

In [ ]:
data.plot(title="Month",
          legend=True,
          style=["r","b","g","k"],  #k-black
          grid=True,
          fontsize=10,
          ylabel="TOTAL",
        xlabel="Month wise",
          figsize=(15,3))

In [ ]:
data.plot(title="Month",
          legend=True,
          style=["r","b","g","k"],
          grid=True,
          fontsize=10,
          ylabel="TOTAL",
        xlabel="Month wise",
          figsize=(15,8),
         subplots=True)#,colormap=["r","b","g","k"])
#plt.show()  # matplot lib -- optional

In [ ]:
data.plot(kind="box")

In [ ]:
data.plot(kind="kde")

In [ ]:
data.plot(kind="density")#'density' : same as 'kde'


- 'scatter' : scatter plot
- 'hexbin' : hexbin plot.

In [ ]:
data.plot(x="Sales_1",y="Sales_2",kind="scatter",s=50) # s- marker size

In [ ]:
data.plot(x="Sales_1",y="Sales_2",kind="hexbin", gridsize=20)

In [ ]:
'''# How a bigger plot look like
import numpy as np
import pandas as pd
n = 500
df = pd.DataFrame({
    'coord_x': np.random.uniform(-3, 3, size=n),
    'coord_y': np.random.uniform(30, 50, size=n),
    'observations': np.random.randint(1,5, size=n)
    })
ax = df.plot.hexbin(x='coord_x',
                    y='coord_y',
                    C='observations',
                   
                    gridsize=15,
                    cmap="viridis")'''

# New Data for encoding and nan (fill null)

In [ ]:
import numpy as np
import pandas as pd
data={"k":np.random.randint(1,100,10),
      "k2":list("abcbabaaca"),
      "k3":[23,34,32,21,np.nan,np.nan,54,np.nan,65,np.nan]}
data["k2"][3]=np.nan
data=pd.DataFrame(data)
data

In [ ]:
data.isnull().sum()

In [ ]:
data.info()

In [ ]:
data.k3.fillna(data.k3.mean())

In [ ]:
data.k2.mode()

In [ ]:
data.k2.mode()[0]

In [ ]:
data.k2.fillna(data.k2.mode()[0])

In [ ]:
data # not updating

In [ ]:
data.k2.fillna(data.k2.mode()[0],inplace=True)
data.k3.fillna(data.k3.mean(),inplace=True)
data

### ENCODING

In [ ]:
data.k2

In [ ]:
pd.get_dummies(data,dtype=int)

In [ ]:
pd.get_dummies(data,drop_first=True,dtype=int)

In [ ]:
pd.get_dummies(data,drop_first=True,prefix="The encoded ",dtype=int)

In [ ]:
pd.get_dummies(data,drop_first=True,prefix="The encoded ",prefix_sep="=> ",dtype=int)

# Concatinate

In [ ]:
dict(x=9)

In [ ]:
import pandas as pd
d=pd.DataFrame(dict(alpha=list("ababe"),beta=[1,2,3,4,5],gama=list("qwert")))
d2=pd.DataFrame(dict(alpha=list("xyzqw"),beta=[9,8,7,6,5],delta=list("asdfg")))

In [ ]:
d

In [ ]:
d2

In [ ]:
pd.concat([d,d2]) # Notice null

In [ ]:
pd.concat([d,d2],axis=0,ignore_index=True) # Look at ur index

In [ ]:
pd.concat([d,d2],axis=1,ignore_index=True) # Look at ur index

In [ ]:
pd.concat([d,d2],axis=1)

In [ ]:
pd.concat([d,d2],axis=1)["alpha"]

# Group By

In [ ]:
d

In [ ]:
d.groupby(["alpha"]).count()

FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  d.groupby(["alpha"]).sum() # total in a row

In [ ]:
d.groupby(["alpha"]).mean(numeric_only=True)

In [ ]:
d.groupby(["alpha"]).mean(numeric_only=True).loc["a"]

In [ ]:
d.groupby(["alpha"]).sum() # total in a row

# END